    #### Динамическая типизация ###

name = 'Denis'  # Создайте переменную name и присвойте ей значение вашего имени (строка).
print('Name: ',name)    # Выведите значение переменной name на экран.

age = 38    # Создайте переменную age и присвойте ей значение вашего возраста (целое число).
print('Age: ', age)    # Выведите значение переменной age на экран.

new_age = '1'    # Перезапишите в age текущее значение переменной age + новое. // Переменная строкового типа !!!
print('New Age: ', age + int(new_age))  #Выведите измененное значение переменной. // Перевод строки в цифровой тип !!

is_student = True   # Создайте переменную is_student и присвойте ей значение True (логическое значение).
print('Is Student: ', is_student)   # Выведите значение переменной is_student на экран.